tap "ankitpokhrel/jira-cli"
tap "arl/arl"
tap "epk/epk"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for manipulating PNG images
brew "libpng"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Text processing system for reStructuredText
brew "docutils"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python 2 and 3 compatibility utilities
brew "six"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Asynchronous DNS library
brew "c-ares"
# Cross-platform make
brew "cmake"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Run arbitrary commands when files change
brew "entr"
# Banner-like program prints strings as ASCII art
brew "figlet"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Core application library for C
brew "glib"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Database of common MIME types
brew "shared-mime-info"
# H.265/HEVC encoder
brew "x265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Macro processing language
brew "m4"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# C library implementing the SSH2 protocol
brew "libssh2"
# X.Org: Inter-Client Exchange Library
brew "libice"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# HTTP/2 C Library
brew "libnghttp2"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# X.Org: X Session Management Library
brew "libsm"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: X Toolkit Intrinsics library
brew "libxt"
# X.Org: X miscellaneous utility routines library
brew "libxmu"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Get, set, and list display resolution
brew "screenresolution"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Perl compatible regular expressions library
brew "pcre"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Format Rust code
brew "rustfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Chromium based browser
cask "arc"
# Collaborative team software
cask "figma"
cask "font-sf-mono-nerd-font"
# Desktop automation application
cask "hammerspoon"
# HTTP and GraphQL Client
cask "insomnia"
# Open-source keystroke visualizer
cask "keycastr"
# Software for Logitech devices
cask "logitech-options"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# App launcher/switcher
cask "spacelauncher"
# Music streaming service
cask "spotify"
# Rust-based terminal
cask "warp"
vscode "alefragnani.project-manager"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "artdiniz.quitcontrol-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "barrsan.reui"
vscode "be5invis.vscode-custom-css"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "cocopon.iceberg-theme"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "GitLab.gitlab-workflow"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hedinne.popping-and-locking-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "IronGeek.vscode-env"
vscode "jdinhlife.gruvbox"
vscode "lkytal.FlatUI"
vscode "mads-hartmann.bash-ide-vscode"
vscode "meganrogge.template-string-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "muhammadsammy.flat-ui-dark"
vscode "naumovs.color-highlight"
vscode "Orta.vscode-twoslash-queries"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "sallar.vscode-duotone-dark"
vscode "sdras.night-owl"
vscode "sgoley.lookml-syntax-highlighter"
vscode "SimonSiefke.svg-preview"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vuesion.vuesion-theme"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.wallaby-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
